# -*- coding:utf-8 -*-
# __author__ = majing

read = ["单选", "图文匹配", "情景选择", "判断", "排序", "连线", "归类", "阅读", "完型填空", "评测项目"]

text_1 = """
选出发音不同的一项
选出与例词发音相同的一项
根据划线部分的读音选择正确的音标
根据所给音标选择单词
根据所给音标选择字母补全单词
根据所给汉语选择正确选项补全单词
选择单词中所缺的字母补全单词
选择近义词或反义词
选同类的一项
选不同类的一项
根据问句选择合适的答句
给英文选择正确译文
题干选项全英的选择题
给汉语选择正确译文
"""

text_2 = """
把所给单词的序号填在对应图片下
把所给图片的序号填在对应词汇下
题干图片选项单词或词组的选择题
题干图片选项句子的选择题
题干文本配图的选择题
选项图片的选择题
图片与对话配对
多图配对多单句
"""






def split_str_to_list(text):
    texts = text.split('\n')
    texts = [item for item in texts if item]
    print(texts)

if __name__ == "__main__":
    split_str_to_list(text)